#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

module.KEYCLOAK_DEV.module.moh_applications.module.MANAGE-USERS.keycloak_role.REALM_ROLE: Refreshing state... [id=8e526714-e19a-4760-b5e8-40efcb2c0b9c]
module.KEYCLOAK_DEV.module.moh_applications.module.PIDP-WEBAPP.module.scope-mappings.keycloak_generic_client_role_mapper.SCOPE-MAPPING["PIDP-SERVICE/USER"]: Refreshing state... [id=moh_applications/client/0a4aed42-f8c1-4004-8218-dc92b231dd70/scope-mappings/f2d7cc73-3c77-44e0-b6fb-cec2ea545629/7f31f194-bfcc-43fd-babe-bc9545292ede]
module.KEYCLOAK_DEV.module.moh_applications.module.PIDP-WEBAPP.module.scope-mappings.keycloak_generic_client_role_mapper.SCOPE-MAPPING["PIDP-SERVICE/feature_pidp_demo"]: Refreshing state... [id=moh_applications/client/0a4aed42-f8c1-4004-8218-dc92b231dd70/scope-mappings/f2d7cc73-3c77-44e0-b6fb-cec2ea545629/a94bec86-0808-4f71-a947-b2049afc7d7e]
module.KEYCLOAK_DEV.module.moh_applications.module.PIDP-WEBAPP.module.scope-mappings.keycloak_generic_client_role_mapper.SCOPE-MAPPING["PIDP-SERVICE/ADMIN"]: Refreshing state... [id=moh_applications/client/0a4aed42-f8c1-4004-8218-dc92b231dd70/scope-mappings/f2d7cc73-3c77-44e0-b6fb-cec2ea545629/9dbc8e8b-0e25-44cd-bd1b-34a1846ac269]
module.KEYCLOAK_DEV.module.moh_applications.module.PIDP-WEBAPP.module.scope-mappings.keycloak_generic_client_role_mapper.SCOPE-MAPPING["account/view-profile"]: Refreshing state... [id=moh_applications/client/0a4aed42-f8c1-4004-8218-dc92b231dd70/scope-mappings/2e52bc4c-f321-4bff-98d8-8ce89cd3e2e7/22f2f067-d74a-4108-bf1a-eb6bffd71736]
module.KEYCLOAK_DEV.module.moh_applications.module.DMFT-SERVICE.module.service-account-roles.keycloak_openid_client_service_account_role.ROLE["PIDP-SERVICE/view_endorsement_data"]: Refreshing state... [id=a0553301-93f9-4017-8c3b-fd34d9ab6f0f/493df53a-c656-4a24-a516-5708b51b7101]
module.KEYCLOAK_DEV.module.moh_applications.module.DMFT-SERVICE.module.scope-mappings.keycloak_generic_client_role_mapper.SCOPE-MAPPING["PIDP-SERVICE/view_endorsement_data"]: Refreshing state... [id=moh_applications/client/2fa5ed3f-39bd-4f67-84be-b1053bec576e/scope-mappings/f2d7cc73-3c77-44e0-b6fb-cec2ea545629/493df53a-c656-4a24-a516-5708b51b7101]
module.KEYCLOAK_TEST.module.moh_applications.module.CGI-DEVELOPER.keycloak_group_roles.GROUP_ROLES: Refreshing state... [id=moh_applications/ba2aead8-cd2d-4519-991b-3bd44c71c057]
module.KEYCLOAK_DEV.module.moh_applications.module.CGI-APPLICATION-SUPPORT.keycloak_role.REALM_ROLE: Refreshing state... [id=66800c9e-d995-4f29-9d06-fba5ed7ebd05]
module.KEYCLOAK_TEST.module.moh_applications.module.CGI-QA.keycloak_group_roles.GROUP_ROLES: Refreshing state... [id=moh_applications/658f081c-a8b0-4c1b-b9ee-7e8901158ce7]
module.KEYCLOAK_TEST.module.moh_applications.module.CGI-MIDTIER.keycloak_group_roles.GROUP_ROLES: Refreshing state... [id=moh_applications/782fe94e-79a2-438f-9bc1-28717395b28d]
module.KEYCLOAK_DEV.module.moh_applications.module.PLR-SHOPPERS.module.scope-mappings.keycloak_generic_client_role_mapper.SCOPE-MAPPING["PLR/REG_ADMIN"]: Refreshing state... [id=moh_applications/client/6f46c738-d23e-4451-988a-7294bc52a402/scope-mappings/dc7b9502-3ffa-4ff8-be2e-ebfebe650590/30f494e9-41c7-40eb-9660-a14bb8248af4]
module.KEYCLOAK_PROD.module.moh_applications.module.CGI-DEVELOPER.keycloak_group_roles.GROUP_ROLES: Refreshing state... [id=moh_applications/e8976c36-6816-4b71-8c2f-3053a8168de7]
module.KEYCLOAK_PROD.module.moh_applications.module.CGI-MID-TIER.keycloak_group_roles.GROUP_ROLES: Refreshing state... [id=moh_applications/303c6348-22b8-4351-abdf-da5b48689724]
module.KEYCLOAK_DEV.module.moh_applications.module.CGI-MID-TIER.keycloak_group_roles.GROUP_ROLES: Refreshing state... [id=moh_applications/4e3d322a-fbe7-438d-8ee7-95a1707d40dc]
module.KEYCLOAK_DEV.module.moh_applications.module.CGI-DBA.keycloak_group_roles.GROUP_ROLES: Refreshing state... [id=moh_applications/9ada1d3b-be63-40a3-84f2-e4ec0e10be88]
module.KEYCLOAK_DEV.module.moh_applications.module.CGI-QA.keycloak_group_roles.GROUP_ROLES: Refreshing state... [id=moh_applications/1798203d-027f-4856-a445-8a90c1dc9756]
module.KEYCLOAK_DEV.module.moh_applications.module.CGI-DEVELOPER.keycloak_group_roles.GROUP_ROLES: Refreshing state... [id=moh_applications/27967216-03f7-4259-b50a-955b995d51ad]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.KEYCLOAK_PROD.module.moh_applications.module.PLR-REGADMIN.keycloak_openid_client.CLIENT will be created
  + resource "keycloak_openid_client" "CLIENT" {
      + access_token_lifespan                     = "18000"
      + access_type                               = "CONFIDENTIAL"
      + backchannel_logout_session_required       = true
      + client_authenticator_type                 = "client-secret"
      + client_id                                 = "PLR-REGADMIN"
      + client_secret                             = (sensitive value)
      + consent_required                          = false
      + description                               = "The Provider and Location Registry (PLR) is a standards-based repository of core provider data supplied by authorized sources. This client will be used to generate access tokens for the internal PLR team with the PLR REG_ADMIN role."
      + direct_access_grants_enabled              = false
      + display_on_consent_screen                 = false
      + enabled                                   = true
      + exclude_session_state_from_auth_response  = false
      + frontchannel_logout_enabled               = false
      + full_scope_allowed                        = false
      + id                                        = (known after apply)
      + implicit_flow_enabled                     = false
      + name                                      = "PLR-REGADMIN"
      + oauth2_device_authorization_grant_enabled = false
      + realm_id                                  = "moh_applications"
      + resource_server_id                        = (known after apply)
      + service_account_user_id                   = (known after apply)
      + service_accounts_enabled                  = true
      + standard_flow_enabled                     = false
      + use_refresh_tokens                        = true
      + use_refresh_tokens_client_credentials     = false
    }

  # module.KEYCLOAK_PROD.module.moh_applications.module.PLR-REGADMIN.keycloak_openid_hardcoded_claim_protocol_mapper.orgId will be created
  + resource "keycloak_openid_hardcoded_claim_protocol_mapper" "orgId" {
      + add_to_access_token = true
      + add_to_id_token     = true
      + add_to_userinfo     = true
      + claim_name          = "orgId"
      + claim_value         = "00000010"
      + claim_value_type    = "String"
      + client_id           = (known after apply)
      + id                  = (known after apply)
      + name                = "orgId"
      + realm_id            = "moh_applications"
    }

  # module.KEYCLOAK_PROD.module.moh_applications.module.PLR-REGADMIN.module.scope-mappings.keycloak_generic_client_role_mapper.SCOPE-MAPPING["PLR/REG_ADMIN"] will be created
  + resource "keycloak_generic_client_role_mapper" "SCOPE-MAPPING" {
      + client_id = (known after apply)
      + id        = (known after apply)
      + realm_id  = "moh_applications"
      + role_id   = "bdc57be4-258c-4b28-b86d-f4b66e8ea8fb"
    }

  # module.KEYCLOAK_PROD.module.moh_applications.module.PLR-REGADMIN.module.service-account-roles.keycloak_openid_client_service_account_realm_role.ROLE["default-roles-moh_applications"] will be created
  + resource "keycloak_openid_client_service_account_realm_role" "ROLE" {
      + id                      = (known after apply)
      + realm_id                = "moh_applications"
      + role                    = "default-roles-moh_applications"
      + service_account_user_id = (known after apply)
    }

  # module.KEYCLOAK_PROD.module.moh_applications.module.PLR-REGADMIN.module.service-account-roles.keycloak_openid_client_service_account_role.ROLE["PLR/REG_ADMIN"] will be created
  + resource "keycloak_openid_client_service_account_role" "ROLE" {
      + client_id               = "cecd3d4b-f68e-4c4a-a9c4-5a2db9aef8ee"
      + id                      = (known after apply)
      + realm_id                = "moh_applications"
      + role                    = "REG_ADMIN"
      + service_account_user_id = (known after apply)
    }

Plan: 5 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>

*Pushed by: @filipflorek, Action: `pull_request`*